# Чернеги Вікторії   Б19_д/122Б
# Програми, що виконують такі операції з масивами:

# 1) виведіть на екран елементи лінійного масиву (заданий користувачем) у зворотньому порядку;

import numpy as np
x = np.array(list(input('Введіть без пробілу: x = ')), dtype = int)            # створення масиву з елементами типу int
print(f'Зворотній порядок {x[::-1]}')                     # вивід елементів масиву за допомогою оператора вилучення зрізу [старт = 1: стоп = довжина масиву: крок = -1]


# 2) виведіть на екран транспоновану матрицю 3*3 (початкова матриця задана користувачем)

a = np.zeros((3,3), dtype = int)                        # створення матриці 3*3, заповненої нулями типу int
for i in range(3):                                      # цикл для проходження по рядкам
    for j in range(3):                                  # цикл для проходження по стовпцям
        a[i,j] = int(input(f'A[{i}, {j}] = '))          # введення елементів матриці
b = np.array(a)                                         # присвоєння даних матриці а матриці b (при транспонуванні будемо використовувати елементи з матриці b)
for i in range(3):                                      # цикл для проходження по рядкам
    for j in range(3):                                  # цикл для проходження по стовпцям
            a [i,j]= b[j,i]                             # заміна елементів матриці а на елементи з матриці b, відносно головної діагоналі
print(f'Транспонована матриця: {a}')                    # вивід транспонованої матриці


# 3) виконайте добуток двох квадратних матриць 3*3, врахуйте розмірність. Результати множення елементів занесіть до нової матриці та виведіть її.

a, b = np.zeros((3,3), dtype = int), np.zeros((3,3), dtype = int)       # створення двох нульових матриць a і b
for i in range(3):                                                      # цикл для проходження по рядкам матриці а
    for j in range(3):                                                  # цикл для проходження по стовпцям матриці a
        a[i,j] = int(input(f'A[{i}, {j}] = '))                          # введення елементів в матрицю а
for i in range(3):                                                      # цикл для проходження по рядкам матриці b
    for j in range(3):                                                  # цикл для проходження по стовпцям матриці b
        b[i,j] = int(input(f'B[{i}, {j}] = '))                          # введення елементів в матрицю b
c = a*b                                                                 # множення a i b, занесення результату множення до нової матриці с
print(f'Матриця, результатом якої є добуток матриці a i b: {c}')                                                                # виведення с


# 4)у матриці 4*4 замінити всі від'ємні елементи на 0

a = np.zeros((4,4), dtype = int)                                        # створення нульової матриці а
for i in range(4):                                                      # цикл для проходження по рядкам матриці а
    for j in range(4):                                                  # цикл для проходження по стовпцям матриці a
        a[i,j] = int(input(f'A[{i}, {j}] = '))                          # введення елементів до матриці а
for i in range(4):                                                      # цикл для проходження по рядкам матриці а
    for j in range(4):                                                  # цикл для проходження по стовпцям матриці a
        if a[i,j]<0:                                                    # умова: якщо елемент менше 0, то замінити його на нуль
            a[i,j] = 0
print(f"Матриця з нулями замість від'ємних чисел: {a}")                                                                # виведення нової матриці