# Чернеги Вікторії   Б19_д/122Б
# 13) Програма виводить на екран країни і кількість експортованих до неї товарів.

country = ['USA', 'Canada', 'Ukraine', 'Italy']             # список з назвами країн
banana = [300, 234, 432, 204]                               # списки з кількостями товарів, які експортовано (індекси товарів у списку відповідають індексам країн, тобто якщо Канада в першому списку має індекс [1], то відповідно кількості товарів, що туди експортовані також мають індекс [1]).
mango = [356, 212, 687, 423]
orange = [167, 289, 156, 435]
lemon = [2434, 789, 1278, 1598]

for i in range(4):                                                      # цикл, що проходить по спискам товарів
    all_items = banana[i] + mango[i] + orange[i] + lemon[i]             # сума товарів, яка була експортована до однієї країни
    print(f'In {country[i]} were exported {all_items} items.')          # вивід назви країни та загальної кількості товарів, що туди експортовано